Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput
The different TS component input options. Matches defines in
Core\TeklaStructures\libcommands\interface\e3_commands_types.h.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.Unknown
Component inputs are unknown.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.OneSecondary
Component input consists of one secondary object.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.ManySecondaries
Component input consists of many secondary objects.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.JointDetail
Component is a joint detail.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.SeamDetail
Component is a seam detail.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.DetailWithoutPoint
Component is a detail without an input point.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.OnePoint
Component input consists of one point.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentInput.TwoPoints
Component input consists of two points.